In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [4]:
ser = Series(np.random.randn(6),
                    index =  [[1,1,1,2,2,2], ['a','b','c','a','b','c']])
ser

1  a    0.138404
   b   -0.367385
   c    1.519983
2  a    0.888778
   b   -0.497301
   c   -0.238970
dtype: float64

In [5]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [6]:
ser[1]

a    0.138404
b   -0.367385
c    1.519983
dtype: float64

In [7]:
ser[2]

a    0.888778
b   -0.497301
c   -0.238970
dtype: float64

In [8]:
ser

1  a    0.138404
   b   -0.367385
   c    1.519983
2  a    0.888778
   b   -0.497301
   c   -0.238970
dtype: float64

In [9]:
ser[:, 'a']

1    0.138404
2    0.888778
dtype: float64

In [10]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.138404 -0.367385  1.519983
2  0.888778 -0.497301 -0.238970

In [11]:
dframe.T.unstack()

1  a    0.138404
   b   -0.367385
   c    1.519983
2  a    0.888778
   b   -0.497301
   c   -0.238970
dtype: float64

In [13]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                           index=[['a','a','b','b'],
                                         [1,2,1,2]], 
                            columns= [['NY', 'NY', 'LA', 'SF'],
                                                 ['cold', 'hot', 'hot', 'cold' ]])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [17]:
dframe2.index.names = ['INDEX_1', 'INDEX_2']
dframe2.columns.names = ['Cities', 'Temp']
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [18]:
dframe2.swaplevel('Cities', 'Temp', axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [20]:
dframe2.sort_index(level=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [21]:
dframe2.sort_index(level=1).sort_index(level=0)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [23]:
dframe2.groupby(level=1).sum()

Cities    NY      LA   SF
Temp    cold hot hot cold
INDEX_2
1          8  10  12   14
2         16  18  20   22